app/controllers/foods_controller.rb

SELECT * FROM `foods`
---
  def index
    @foods = Food.all

SELECT * FROM `foods` WHERE (`foods`.`id` = 1)
---
  def show
    @food = Food.find(params[:id])

SELECT * FROM `foods` WHERE (`foods`.`id` = 1)
---
  def edit
    @food = Food.find(params[:id])

INSERT INTO `foods` (`name`, `calcium`, `vitamin_k`, `created_at`, `niacin`, `vitamin_b12`, `vitamin_a_rae`, `energy`, `phosphorus`, `vitamin_a_iu`, `alcohol`, `water`, `updated_at`, `magnesium`, `vitamin_c`, `riboflavin`, `total_polyunsaturated_fats`, `protein`, `copper`, `vitamin_b6`, `caffeine`, `total_sugars`, `zinc`, `fluoride`, `alpha_carotene`, `vitamin_e`, `total_unsaturated_fats`, `sodium`, `lycopene`, `total_dietary_fiber`, `selenium`, `thiamin`, `carbohydrate`, `manganese`, `beta_carotene`, `total_saturated_fats`, `total_fats`, `iron`, `potassium`) VALUES('Bananas, raw', 5.0, NULL, '2009-08-16 14:13:29', NULL, NULL, 3.0, 371.0, NULL, 64.0, NULL, 74.91, '2009-08-16 14:13:29', NULL, 8.7, NULL, NULL, 1.09, NULL, NULL, NULL, 12.23, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2.6, NULL, NULL, 22.84, NULL, NULL, NULL, 0.33, NULL, 358.0)
---
  def create
    @food = Food.new(params[:food])

    respond_to do |format|
      if @food.save

SELECT * FROM `foods` WHERE (`foods`.`id` = 3)
---
  def update
    @food = Food.find(params[:id])

SELECT * FROM `foods` WHERE (`foods`.`id` = 2)
DELETE FROM `foods` WHERE `id` = 2
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy