app/controllers/meal_plans_controller.rb

  def index
      @meal_plans = MealPlan.all
---
SELECT * FROM `meal_plans`

  def show
    @meal_plan = MealPlan.find(params[:id])
---
SELECT * FROM `meal_plans` WHERE (`meal_plans`.`id` = 1)

  def edit
    @meal_plan = MealPlan.find(params[:id])
---
SELECT * FROM `meal_plans` WHERE (`meal_plans`.`id` = 2)

  def create
    @meal_plan = MealPlan.new(params[:meal_plan])
    if @meal_plan.save
---
INSERT INTO `meal_plans` (`name`, `created_at`, `updated_at`) VALUES('My Meal Plan', '2009-09-07 19:52:06', '2009-09-07 19:52:06')

  def update
    @meal_plan = MealPlan.find(params[:id])

    if @meal_plan.update_attributes(params[:meal_plan])
---
SELECT * FROM `meal_plans` WHERE (`meal_plans`.`id` = 2)
UPDATE `meal_plans` SET `updated_at` = '2009-09-07 20:08:41', `name` = 'My Meal Plan!' WHERE `id` = 2

  def destroy
    @meal_plan = MealPlan.find(params[:id])
    @meal_plan.destroy
---
SELECT * FROM `meal_plans` WHERE (`meal_plans`.`id` = 1)
DELETE FROM `meal_plans` WHERE `id` = 1