app/controllers/serving_sizes_controller.rb

  def index
     @food = Food.find(params[:food_id])
---
SELECT * FROM `foods` WHERE (`foods`.`id` = 1)

  def show
     @food = Food.find(params[:food_id])
     @serving_size = @food.serving_sizes.find(params[:id])
---
SELECT * FROM `foods` WHERE (`foods`.`id` = 1)
SELECT * FROM `serving_sizes` WHERE (`serving_sizes`.`id` = 1 AND (`serving_sizes`.food_id = 1))

  def new
     @food = Food.find(params[:food_id])
---
SELECT * FROM `foods` WHERE (`foods`.`id` = 1)

  def create
     @food = Food.find(params[:food_id])
     @serving_size = @food.serving_sizes.build(params[:serving_size])
     if @serving_size.save
---
SELECT * FROM `foods` WHERE (`foods`.`id` = 1)
INSERT INTO `serving_sizes` (`created_at`, `mass`, `updated_at`, `food_id`, `description`) VALUES('2009-09-07 06:52:04', 100.0, '2009-09-07 06:52:04', 1, '100 grams')