app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `username`) VALUES('2009-09-07 11:20:30', '2009-09-07 11:20:30', 'joshua')