app/controllers/users_meal_plans_controller.rb

  def index
    if (params[:user_id])
      @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5)

  def new
    if(params[:user_id])
      @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5)

  def create
    @users_meal_plan = UsersMealPlan.new(params[:users_meal_plan])
    if @users_meal_plan.save
---
INSERT INTO `users_meal_plans` (`created_at`, `meal_plan_id`, `updated_at`, `user_id`) VALUES('2009-09-09 07:16:35', NULL, '2009-09-09 07:16:35', NULL)